<?php

use Illuminate\Database\Migrations\Migration;
use Illuminate\Database\Schema\Blueprint;
use Illuminate\Support\Facades\DB;
use Illuminate\Support\Facades\Schema;

class CreateSubjectsTable extends Migration
{
    /**
     * Run the migrations.
     *
     * @return void
     */
    public function up()
    {
        Schema::create('subjects', function (Blueprint $table) {
            $table->id();
            $table->text('title');
            $table->text('categories')->nullable();
            $table->text('page')->nullable();
            $table->text('description')->nullable();
            $table->text('keywords_seo')->nullable();
            $table->text('description_seo')->nullable();
            $table->timestamps();
        });

        DB::table('subjects')->insert([
            [
                'title' => 'مشاوره استرس',
                'categories' => 'پزشکی,روانپزشکی',

                'page' => 'توضیحات موضوع مشاوره',
                'description' => 'برای ساختن پیوند زناشویی مشترک،‌ نیاز است که مهم‌ترین تصمیم زندگی که ازدواج است، با آگاهی و سوالات مشخص و هدفمند گرفته شود. مشاوران  با مشاوره قبل از ازدواج به شما کمک می‌کنند این مسیر را با اطمینان و
                              شناخت جلو ببرید. با مشورت با متخصص در حوزه ازدواج به خودتان این اجازه را دهید، که برای ادامه زندگی‌تان تصمیمی بگیرید که همه جوانب را در نظر گرفته باشد و در نهایتا از این تصمیم هوشمندانه در تمام زندگی خود لذت ببرید.
                              مشاوره ازدواج آنلاین خدمتی است که با استفاده از  مشاور من  می‌توانید به آن دسترسی داشته باشید.',
                'keywords_seo' => '2020-10-07 06:05:53',
                'description_seo' => '15',
            ],
            [
                'title' => 'مشاوره ترس',
                'categories' => 'پزشکی,روانشناسی',

                'page' => 'توضیحات موضوع مشاوره',
                'description' => 'برای ساختن پیوند زناشویی مشترک،‌ نیاز است که مهم‌ترین تصمیم زندگی که ازدواج است، با آگاهی و سوالات مشخص و هدفمند گرفته شود. مشاوران  با مشاوره قبل از ازدواج به شما کمک می‌کنند این مسیر را با اطمینان و
                              شناخت جلو ببرید. با مشورت با متخصص در حوزه ازدواج به خودتان این اجازه را دهید، که برای ادامه زندگی‌تان تصمیمی بگیرید که همه جوانب را در نظر گرفته باشد و در نهایتا از این تصمیم هوشمندانه در تمام زندگی خود لذت ببرید.
                              مشاوره ازدواج آنلاین خدمتی است که با استفاده از  مشاور من  می‌توانید به آن دسترسی داشته باشید.',
                'keywords_seo' => '2020-10-07 06:05:53',
                'description_seo' => '15',
            ],
            [
                'title' => 'مشاوره شجاعت',
                'categories' => 'روانشناسی,روانپزشکی',

                'page' => 'توضیحات موضوع مشاوره',
                'description' => 'برای ساختن پیوند زناشویی مشترک،‌ نیاز است که مهم‌ترین تصمیم زندگی که ازدواج است، با آگاهی و سوالات مشخص و هدفمند گرفته شود. مشاوران  با مشاوره قبل از ازدواج به شما کمک می‌کنند این مسیر را با اطمینان و
                              شناخت جلو ببرید. با مشورت با متخصص در حوزه ازدواج به خودتان این اجازه را دهید، که برای ادامه زندگی‌تان تصمیمی بگیرید که همه جوانب را در نظر گرفته باشد و در نهایتا از این تصمیم هوشمندانه در تمام زندگی خود لذت ببرید.
                              مشاوره ازدواج آنلاین خدمتی است که با استفاده از  مشاور من  می‌توانید به آن دسترسی داشته باشید.',
                'keywords_seo' => '2020-10-07 06:05:53',
                'description_seo' => '15',
            ],
            [
                'title' => 'مشاوره کار کردن',
                'categories' => 'پزشکی,روانشناسی',

                'page' => 'توضیحات موضوع مشاوره',
                'description' => 'برای ساختن پیوند زناشویی مشترک،‌ نیاز است که مهم‌ترین تصمیم زندگی که ازدواج است، با آگاهی و سوالات مشخص و هدفمند گرفته شود. مشاوران  با مشاوره قبل از ازدواج به شما کمک می‌کنند این مسیر را با اطمینان و
                              شناخت جلو ببرید. با مشورت با متخصص در حوزه ازدواج به خودتان این اجازه را دهید، که برای ادامه زندگی‌تان تصمیمی بگیرید که همه جوانب را در نظر گرفته باشد و در نهایتا از این تصمیم هوشمندانه در تمام زندگی خود لذت ببرید.
                              مشاوره ازدواج آنلاین خدمتی است که با استفاده از  مشاور من  می‌توانید به آن دسترسی داشته باشید.',
                'keywords_seo' => '2020-10-07 06:05:53',
                'description_seo' => '15',
            ],
            [
                'title' => 'مشاوره درس خواندن',
                'categories' => 'پزشکی,روانپزشکی',

                'page' => 'توضیحات موضوع مشاوره',
                'description' => 'برای ساختن پیوند زناشویی مشترک،‌ نیاز است که مهم‌ترین تصمیم زندگی که ازدواج است، با آگاهی و سوالات مشخص و هدفمند گرفته شود. مشاوران  با مشاوره قبل از ازدواج به شما کمک می‌کنند این مسیر را با اطمینان و
                              شناخت جلو ببرید. با مشورت با متخصص در حوزه ازدواج به خودتان این اجازه را دهید، که برای ادامه زندگی‌تان تصمیمی بگیرید که همه جوانب را در نظر گرفته باشد و در نهایتا از این تصمیم هوشمندانه در تمام زندگی خود لذت ببرید.
                              مشاوره ازدواج آنلاین خدمتی است که با استفاده از  مشاور من  می‌توانید به آن دسترسی داشته باشید.',
                'keywords_seo' => '2020-10-07 06:05:53',
                'description_seo' => '15',
            ],
        ]);
    }

    /**
     * Reverse the migrations.
     *
     * @return void
     */
    public function down()
    {
        Schema::dropIfExists('subjects');
    }
}
